In [1]:
import pandas as pd
import numpy as np
# Create data
stuff = {
    "Corpration":["Apple","Google","Meta","Apple","Google","Meta"],
    "Employees":["John","April","Wes","Beth","Justin","Steph"],
    "Salary":[200,220,190,130,120,125]
}
my_df = pd.DataFrame(stuff)
my_df

  Corpration Employees  Salary
0      Apple      John     200
1     Google     April     220
2       Meta       Wes     190
3      Apple      Beth     130
4     Google    Justin     120
5       Meta     Steph     125

In [3]:
# Group by Corpration - To get object location in memory
company = my_df.groupby("Corpration")
company

In [5]:
# Sum
company.sum(numeric_only=True)

            Salary
Corpration
Apple          330
Google         340
Meta           315

In [8]:
# Mean
company.mean(numeric_only=True)

            Salary
Corpration
Apple        165.0
Google       170.0
Meta         157.5

In [11]:
# Max min
company.max(numeric_only=True)
# also do this with min

            Salary
Corpration
Apple          130
Google         120
Meta           125

In [13]:
# Standard Deviation
company.std(numeric_only=True)

               Salary
Corpration
Apple       49.497475
Google      70.710678
Meta        45.961941

In [14]:
# Variance
company.var(numeric_only=True)

            Salary
Corpration
Apple       2450.0
Google      5000.0
Meta        2112.5

In [15]:
# Count
company.count()

            Employees  Salary
Corpration
Apple               2       2
Google              2       2
Meta                2       2

In [16]:
# Describe
company.describe()

           Salary
            count   mean        std    min     25%    50%     75%    max
Corpration
Apple         2.0  165.0  49.497475  130.0  147.50  165.0  182.50  200.0
Google        2.0  170.0  70.710678  120.0  145.00  170.0  195.00  220.0
Meta          2.0  157.5  45.961941  125.0  141.25  157.5  173.75  190.0